## SQL Notes - Harshita Uppalpati
***DDL(Data Definition Language)***

● CREATE TABLE:

In [ ]:
CREATE TABLE employees (id INT PRIMARY KEY, name VARCHAR(50),
salary DECIMAL(10, 2));

● ALTER TABLE:

In [ ]:
ALTER TABLE employees ADD COLUMN email VARCHAR(100);

● DROP TABLE:

In [ ]:
DROP TABLE employees;

● TRUNCATE TABLE:

In [ ]:
TRUNCATE TABLE table_name

**DATA QUERY/RETRIEVAL LANGUAGE (DQL or DRL)**

● SELECT:

In [ ]:
SELECT CustomerName, City FROM Customers;

**DML{DATA MANIPULATION LANGUAGE}**

● INSERT:

In [ ]:
INSERT INTO employees (first_name, last_name, salary) VALUES ('John',
'Doe', 50000);

● UPDATE:

In [ ]:
UPDATE employees SET salary = 55000 WHERE first_name = 'John';

● DELETE:

In [ ]:
DELETE FROM employees WHERE last_name = 'Doe';

● WHERE:

* Operators used in WHERE are:
= : Equal
> : Greater than
< : Less than
>= : Greater than or equal
<= : Less than or equal
<> : Not equal.

In [ ]:
SELECT * FROM Customers WHERE Country='Mexico';

● AND, OR and NOT:

In [ ]:
SELECT * FROM Customers WHERE Country='India' AND City='Japan';

In [ ]:
SELECT * FROM Customers WHERE Country='America' AND (City='India' OR
City='Korea');

● DISTINCT:

In [ ]:
SELECT DISTINCT column1, column2 FROM table_name;

● LIKE:

In [ ]:
SELECT * FROM employees WHERE first_name LIKE 'J%';

● IN:

In [ ]:
SELECT * FROM products WHERE category_id IN (1, 2, 3);

● BETWEEN:

In [ ]:
SELECT * FROM orders WHERE order_date BETWEEN '2023-01-01' AND
'2023-06-30';

● IS NULL:

In [ ]:
SELECT * FROM customers WHERE email IS NULL;

● AS:

In [ ]:
SELECT first_name AS "First Name", last_name AS "Last Name" FROM
employees;

● ORDER BY:

In [ ]:
SELECT column1, column2 FROM table_name ORDER BY column1
[ASC|DESC];

● GROUP BY

In [ ]:
SELECT column1, aggregate_function(column2) FROM table_name
GROUP BY column1;

● AGGREGATE FUNCTIONS



*  Common Aggregate Functions:
- COUNT():
Counts the number of rows in a group or result set.
- SUM():
Calculates the sum of numeric values in a group or result set.
- AVG():

Computes the average of numeric values in a group or result set.
- MAX():
Finds the maximum value in a group or result set.
- MIN():
Retrieves the minimum value in a group or result set.

In [ ]:
SELECT department, COUNT(*) FROM employees GROUP BY department ORDER BY COUNT(*) DESC;

**DCL (Data Control Language)t**

1. GRANT:

In [ ]:
GRANT SELECT ON Employees TO Analyst;

2. REVOKE:

In [ ]:
REVOKE SELECT ON Employees FROM Analyst;

**TCL (Transaction Control Language)**

1. COMMIT:

In [ ]:
UPDATE Employees
SET Salary = Salary * 1.10
WHERE Department = 'Sales';

2. ROLLBACK:

In [ ]:
UPDATE Inventory
SET Quantity = Quantity - 10
WHERE ProductID = 101;

3. SAVEPOINT:

In [ ]:
UPDATE Accounts
SET Balance = Balance - 100
WHERE AccountID = 123;

In [ ]:
SAVEPOINT before_withdrawal;

In [ ]:
UPDATE Accounts
SET Balance = Balance + 100
WHERE AccountID = 456;

In [ ]:
ROLLBACK TO before_withdrawal;

In [ ]:
COMMIT;

**JOINS**

1.Inner Join:

In [ ]:
SELECT Customers.CustomerName, Orders.Product
FROM Customers
INNER JOIN Orders ON Customers.CustomerID = Orders.CustomerID;

2. Left Outer Join (Left Join):

In [ ]:
SELECT Customers.CustomerName, Orders.Product
FROM Customers
LEFT JOIN Orders ON Customers.CustomerID = Orders.CustomerID;

3. Right Outer Join (Right Join):

In [ ]:
SELECT Customers.CustomerName, Orders.Product
FROM Customers
RIGHT JOIN Orders ON Customers.CustomerID = Orders.CustomerID;

4. Full Outer Join (Full Join):

In [ ]:
SELECT Customers.CustomerName, Orders.Product
FROM Customers
FULL OUTER JOIN Orders ON Customers.CustomerID = Orders.CustomerID;

4. Self Join

In [ ]:
SELECT e1.EmployeeName AS Employee, e2.EmployeeName AS Manager
FROM Employees AS e1
JOIN Employees AS e2 ON e1.ManagerID = e2.EmployeeID;